devdnl/dnx-rtos/src/system/drivers/clk/stm32h7/clk.c
/*=========================================================================*//**
@file    clk.c

@author  Daniel Zorychta

@brief   File support system clock (PLL).

@note    Copyright (C) 2020 Daniel Zorychta <daniel.zorychta@gmail.com>

         This program is free software; you can redistribute it and/or modify
         it under the terms of the GNU General Public License as published by
         the Free Software Foundation and modified by the dnx RTOS exception.

         NOTE: The modification  to the GPL is  included to allow you to
               distribute a combined work that includes dnx RTOS without
               being obliged to provide the source  code for proprietary
               components outside of the dnx RTOS.

         The dnx RTOS  is  distributed  in the hope  that  it will be useful,
         but WITHOUT  ANY  WARRANTY;  without  even  the implied  warranty of
         MERCHANTABILITY  or  FITNESS  FOR  A  PARTICULAR  PURPOSE.  See  the
         GNU General Public License for more details.

         Full license text is available on the following file: doc/license.txt.


*//*==========================================================================*/

/*==============================================================================
  Include files
==============================================================================*/
#include "drivers/driver.h"
#include "stm32h7/clk_cfg.h"
#include "stm32h7/stm32h7xx.h"
#include "stm32h7/lib/stm32h7xx_ll_rcc.h"
#include "../clk_ioctl.h"

/*==============================================================================
  Local symbolic constants/macros
==============================================================================*/
#define TIMEOUT_MS                      250
#define LSE_TIMEOUT_MS                  5000

/*==============================================================================
  Local types, enums definitions
==============================================================================*/

/*==============================================================================
  Local function prototypes
==============================================================================*/

/*==============================================================================
  Local object definitions
==============================================================================*/

/*==============================================================================
  Exported object definitions
==============================================================================*/

/*==============================================================================
  Function definitions
==============================================================================*/

//==============================================================================
/**
 * @brief Initialize device
 *
 * @param[out]          **device_handle        device allocated memory
 * @param[in ]            major                major device number
 * @param[in ]            minor                minor device number
 * @param[in ]            config               optional module configuration
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_INIT(CLK, void **device_handle, u8_t major, u8_t minor, const void *config)
{
        UNUSED_ARG4(device_handle, major, minor, config);

        int err = ESUCC;

        LL_RCC_DeInit();

        //----------------------------------------------------------------------
        // LSI OSCILLATOR
        //----------------------------------------------------------------------
        if (__CLK_LSI_ON__) {
                LL_RCC_LSI_Enable();

                u64_t tref = sys_time_get_reference();
                while (not sys_time_is_expired(tref, TIMEOUT_MS)) {
                        if (LL_RCC_LSI_IsReady()) {
                                break;
                        }
                }

                if (sys_time_is_expired(tref, TIMEOUT_MS)) {
                        printk("CLK: LSI timeout");
                }
        }

        //----------------------------------------------------------------------
        // LSE OSCILLATOR
        //----------------------------------------------------------------------
        if (__CLK_LSE_ON__) {

                SET_BIT(PWR->CR1, PWR_CR1_DBP);

                if (!(RCC->BDCR & RCC_BDCR_LSERDY)) {

                        if (__CLK_LSE_ON__ == _CLK_BAYPASS) {
                                LL_RCC_LSE_EnableBypass();

                        } else {
                                LL_RCC_LSE_Enable();

                                u64_t tref = sys_time_get_reference();
                                while (not sys_time_is_expired(tref, TIMEOUT_MS)) {
                                        if (LL_RCC_LSE_IsReady()) {
                                                break;
                                        }
                                }

                                if (sys_time_is_expired(tref, TIMEOUT_MS)) {
                                        printk("CLK: LSE timeout");
                                }
                        }
                }
        }

        //----------------------------------------------------------------------
        // HSE OSCILLATOR
        //----------------------------------------------------------------------
        if (__CLK_HSE_ON__) {

                if (__CLK_HSE_ON__ == _CLK_BAYPASS) {
                        LL_RCC_HSE_Enable();
                        LL_RCC_HSE_EnableBypass();

                } else {
                        LL_RCC_HSE_Enable();

                        u64_t tref = sys_time_get_reference();
                        while (not sys_time_is_expired(tref, TIMEOUT_MS)) {
                                if (LL_RCC_HSE_IsReady()) {
                                        break;
                                }
                        }

                        if (sys_time_is_expired(tref, TIMEOUT_MS)) {
                                printk("CLK: HSE timeout");
                        }
                }
        }

        //----------------------------------------------------------------------
        // PLL1
        //----------------------------------------------------------------------
#define __CLK_PLL1_P__ 1
#define __CLK_PLL1_Q__ 1
#define __CLK_PLL1_R__ 1
#define __CLK_PLL1_M__ 8 // 0-63
#define __CLK_PLL1_N__ 60 // 4-512

        u32_t pllinputfreq = 0;

        switch (LL_RCC_PLL_GetSource()) {
        case LL_RCC_PLLSOURCE_HSI:
                if (LL_RCC_HSI_IsReady() != 0U) {
                        pllinputfreq = HSI_VALUE >> (LL_RCC_HSI_GetDivider() >> RCC_CR_HSIDIV_Pos);
                }
                break;

        case LL_RCC_PLLSOURCE_CSI:
                if (LL_RCC_CSI_IsReady() != 0U) {
                        pllinputfreq = CSI_VALUE;
                }
                break;

        case LL_RCC_PLLSOURCE_HSE:
                if (LL_RCC_HSE_IsReady() != 0U) {
                        pllinputfreq = HSE_VALUE;
                }
                break;
        }

        u32_t pll_input_range;
        u32_t pll_ouput_range;

        if (pllinputfreq >= 8000000) {
                pll_input_range = LL_RCC_PLLINPUTRANGE_8_16;
                pll_ouput_range = LL_RCC_PLLVCORANGE_WIDE;
        } else if (pllinputfreq >= 4000000) {
                pll_input_range = LL_RCC_PLLINPUTRANGE_4_8;
                pll_ouput_range = LL_RCC_PLLVCORANGE_WIDE;
        } else if (pllinputfreq >= 2000000) {
                pll_input_range = LL_RCC_PLLINPUTRANGE_2_4;
                pll_ouput_range = LL_RCC_PLLVCORANGE_WIDE;
        } else {
                pll_input_range = LL_RCC_PLLINPUTRANGE_1_2;
                pll_ouput_range = LL_RCC_PLLVCORANGE_MEDIUM;
        }




