devdnl/dnx-rtos/src/system/drivers/clk/stm32h7/clk.c
        /* Configure voltage regulator */
        //Set the highest core voltage (Scale 1)
        SET_BIT(PWR->D3CR, PWR_D3CR_VOS_1 | PWR_D3CR_VOS_0);
        u64_t tref = sys_time_get_reference();
        while (not (PWR->D3CR & PWR_D3CR_VOSRDY)) {
                if (sys_time_is_expired(tref, TIMEOUT_MS)) {
                        printk("CLK: VOSRDY timeout");
                        break;
                }

                sys_sleep_ms(1);
        }


        SET_BIT(RCC->APB4ENR, RCC_APB4ENR_SYSCFGEN);
        SET_BIT(SYSCFG->PWRCR, SYSCFG_PWRCR_ODEN);
        tref = sys_time_get_reference();
        while (not (PWR->D3CR & PWR_D3CR_VOSRDY)) {
                if (sys_time_is_expired(tref, TIMEOUT_MS)) {
                        printk("CLK: VOSRDY timeout");
                        break;
                }

                sys_sleep_ms(1);
        }






        LL_RCC_PLL1P_Enable(); // osobne sterowanie
        LL_RCC_PLL1Q_Enable();
        LL_RCC_PLL1R_Enable();

        LL_RCC_PLL1_SetP(__CLK_PLL1_P__);
        LL_RCC_PLL1_SetQ(__CLK_PLL1_Q__);
        LL_RCC_PLL1_SetR(__CLK_PLL1_R__);
        LL_RCC_PLL1_SetM(__CLK_PLL1_M__);
        LL_RCC_PLL1_SetN(__CLK_PLL1_N__);

        LL_RCC_PLL1_SetVCOOutputRange(pll_ouput_range);
        LL_RCC_PLL1_SetVCOInputRange(pll_input_range);

        LL_RCC_PLL1_Enable();

        tref = sys_time_get_reference();
        while (not LL_RCC_PLL1_IsReady()) {
                if (sys_time_is_expired(tref, TIMEOUT_MS)) {
                        printk("CLK: PLL1 timeout");
                        break;
                }

                sys_sleep_ms(1);
        }








        LL_RCC_SetSysPrescaler(LL_RCC_SYSCLK_DIV_1);
        LL_RCC_SetAHBPrescaler(LL_RCC_AHB_DIV_2);
        LL_RCC_SetAPB1Prescaler(LL_RCC_APB1_DIV_8);
        LL_RCC_SetAPB2Prescaler(LL_RCC_APB2_DIV_8);
        LL_RCC_SetAPB3Prescaler(LL_RCC_APB3_DIV_8);
        LL_RCC_SetAPB4Prescaler(LL_RCC_APB4_DIV_8);

        LL_RCC_SetSysClkSource(LL_RCC_SYS_CLKSOURCE_PLL1);
        while (LL_RCC_GetSysClkSource() != LL_RCC_SYS_CLKSOURCE_STATUS_PLL1);



        sys_update_system_clocks();

        return err;
}

//==============================================================================
/**
 * @brief Release device
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_RELEASE(CLK, void *device_handle)
{
        UNUSED_ARG1(device_handle);

        LL_RCC_DeInit();
        sys_update_system_clocks();

        return ESUCC;
}

//==============================================================================
/**
 * @brief Open device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           flags                  file operation flags (O_RDONLY, O_WRONLY, O_RDWR)
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_OPEN(CLK, void *device_handle, u32_t flags)
{
        UNUSED_ARG2(device_handle, flags);
        return ESUCC;
}

//==============================================================================
/**
 * @brief Close device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           force                  device force close (true)
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_CLOSE(CLK, void *device_handle, bool force)
{
        UNUSED_ARG2(device_handle, force);
        return ESUCC;
}

//==============================================================================
/**
 * @brief Write data to device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]          *src                    data source
 * @param[in ]           count                  number of bytes to write
 * @param[in ][out]     *fpos                   file position
 * @param[out]          *wrcnt                  number of written bytes
 * @param[in ]           fattr                  file attributes
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_WRITE(CLK,
              void             *device_handle,
              const u8_t       *src,
              size_t            count,
              fpos_t           *fpos,
              size_t           *wrcnt,
              struct vfs_fattr  fattr)
{
        UNUSED_ARG6(device_handle, src, count, fpos, wrcnt, fattr);
        return ENOTSUP;
}

//==============================================================================
/**
 * @brief Read data from device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *dst                    data destination
 * @param[in ]           count                  number of bytes to read
 * @param[in ][out]     *fpos                   file position
 * @param[out]          *rdcnt                  number of read bytes
 * @param[in ]           fattr                  file attributes
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_READ(CLK,
             void            *device_handle,
             u8_t            *dst,
             size_t           count,
             fpos_t          *fpos,
             size_t          *rdcnt,
             struct vfs_fattr fattr)
{
        UNUSED_ARG6(device_handle, dst, count, fpos, rdcnt, fattr);
        return ENOTSUP;
}

//==============================================================================
/**
 * @brief IO control
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           request                request
 * @param[in ][out]     *arg                    request's argument
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_IOCTL(CLK, void *device_handle, int request, void *arg)
{
        UNUSED_ARG1(device_handle);

