devdnl/dnx-rtos/src/system/drivers/clk/stm32h7/clk.c
        int err = EINVAL;

        if (arg) {
                if (request == IOCTL_CLK__GET_CLK_INFO) {
                        CLK_info_t *clkinf = arg;

                        switch (clkinf->iterator) {
                        case 0: {
                                LL_RCC_ClocksTypeDef freq;
                                LL_RCC_GetSystemClocksFreq(&freq);
                                clkinf->freq_Hz = freq.SYSCLK_Frequency;
                                clkinf->name = "SYSCLK";
                                break;
                        }

                        case 1: {
                                LL_RCC_ClocksTypeDef freq;
                                LL_RCC_GetSystemClocksFreq(&freq);
                                clkinf->freq_Hz = freq.HCLK_Frequency;
                                clkinf->name = "HCLK";
                                break;
                        }

                        case 2: {
                                LL_RCC_ClocksTypeDef freq;
                                LL_RCC_GetSystemClocksFreq(&freq);
                                clkinf->freq_Hz = freq.PCLK1_Frequency;
                                clkinf->name = "PCLK1";
                                break;
                        }

                        case 3: {
                                LL_RCC_ClocksTypeDef freq;
                                LL_RCC_GetSystemClocksFreq(&freq);
                                clkinf->freq_Hz = freq.PCLK2_Frequency;
                                clkinf->name = "PCLK2";
                                break;
                        }

                        case 4: {
                                LL_RCC_ClocksTypeDef freq;
                                LL_RCC_GetSystemClocksFreq(&freq);
                                clkinf->freq_Hz = freq.PCLK3_Frequency;
                                clkinf->name = "PCLK3";
                                break;
                        }

                        case 5: {
                                LL_RCC_ClocksTypeDef freq;
                                LL_RCC_GetSystemClocksFreq(&freq);
                                clkinf->freq_Hz = freq.PCLK4_Frequency;
                                clkinf->name = "PCLK4";
                                break;
                        }

                        case 6: {
                                LL_PLL_ClocksTypeDef pll;
                                LL_RCC_GetPLL1ClockFreq(&pll);
                                clkinf->freq_Hz = pll.PLL_P_Frequency;
                                clkinf->name    = "PLL1P";
                                break;
                        }

                        case 7: {
                                LL_PLL_ClocksTypeDef pll;
                                LL_RCC_GetPLL1ClockFreq(&pll);
                                clkinf->freq_Hz = pll.PLL_Q_Frequency;
                                clkinf->name    = "PLL1Q";
                                break;
                        }

                        case 8: {
                                LL_PLL_ClocksTypeDef pll;
                                LL_RCC_GetPLL1ClockFreq(&pll);
                                clkinf->freq_Hz = pll.PLL_R_Frequency;
                                clkinf->name    = "PLL1R";
                                break;
                        }

                        case 9: {
                                LL_PLL_ClocksTypeDef pll;
                                LL_RCC_GetPLL2ClockFreq(&pll);
                                clkinf->freq_Hz = pll.PLL_P_Frequency;
                                clkinf->name    = "PLL2P";
                                break;
                        }

                        case 10: {
                                LL_PLL_ClocksTypeDef pll;
                                LL_RCC_GetPLL2ClockFreq(&pll);
                                clkinf->freq_Hz = pll.PLL_Q_Frequency;
                                clkinf->name    = "PLL2Q";
                                break;
                        }

                        case 11: {
                                LL_PLL_ClocksTypeDef pll;
                                LL_RCC_GetPLL2ClockFreq(&pll);
                                clkinf->freq_Hz = pll.PLL_R_Frequency;
                                clkinf->name    = "PLL2R";
                                break;
                        }

                        case 12: {
                                LL_PLL_ClocksTypeDef pll;
                                LL_RCC_GetPLL3ClockFreq(&pll);
                                clkinf->freq_Hz = pll.PLL_P_Frequency;
                                clkinf->name    = "PLL3P";
                                break;
                        }

                        case 13: {
                                LL_PLL_ClocksTypeDef pll;
                                LL_RCC_GetPLL3ClockFreq(&pll);
                                clkinf->freq_Hz = pll.PLL_Q_Frequency;
                                clkinf->name    = "PLL3Q";
                                break;
                        }

                        case 14: {
                                LL_PLL_ClocksTypeDef pll;
                                LL_RCC_GetPLL3ClockFreq(&pll);
                                clkinf->freq_Hz = pll.PLL_R_Frequency;
                                clkinf->name    = "PLL3R";
                                break;
                        }

                        case 15:
                                clkinf->freq_Hz = LL_RCC_GetUSARTClockFreq(LL_RCC_USART16_CLKSOURCE);
                                clkinf->name = "USART1";
                                break;

                        case 16:
                                clkinf->freq_Hz = LL_RCC_GetUSARTClockFreq(LL_RCC_USART234578_CLKSOURCE);
                                clkinf->name = "USART2";
                                break;

                        case 17:
                                clkinf->freq_Hz = LL_RCC_GetUSARTClockFreq(LL_RCC_USART234578_CLKSOURCE);
                                clkinf->name = "USART3";
                                break;

                        case 18:
                                clkinf->freq_Hz = LL_RCC_GetUSARTClockFreq(LL_RCC_USART234578_CLKSOURCE);
                                clkinf->name = "UART4";
                                break;

                        case 19:
                                clkinf->freq_Hz = LL_RCC_GetUSARTClockFreq(LL_RCC_USART234578_CLKSOURCE);
                                clkinf->name = "UART5";
                                break;

                        case 20:
                                clkinf->freq_Hz = LL_RCC_GetUSARTClockFreq(LL_RCC_USART16_CLKSOURCE);
                                clkinf->name = "USART6";
                                break;

                        case 21:
                                clkinf->freq_Hz = LL_RCC_GetUSARTClockFreq(LL_RCC_USART234578_CLKSOURCE);
                                clkinf->name = "UART7";
                                break;

                        case 22:
                                clkinf->freq_Hz = LL_RCC_GetUSARTClockFreq(LL_RCC_USART234578_CLKSOURCE);
                                clkinf->name = "UART8";
                                break;

